#задача 1 
# age =int(input("Ведите возраст: "))
# if age < 18:
#     print("Вы являетесь несовершеннолетним.")
# elif age > 18 and age  <65:
#     print("Вы являетесь взрослым.")
# elif age >65 and age <100:
#     print("Вы являетесь пожилым.")
# else:
#     print("Error")
#задача 2
# num1 = int(input("Введите первое число:"))
# num2 = int(input("Введите второе число:"))
# num3 = int(input("Введите третье число:"))

# min_num = min(num1, num2, num3)
# print(min_num)

#задавча 3
# name_list =["Бишкек", "Ош","Чуй","Нарын","Баткен","Заманчивая","Кетким келет","До конца",
#  "Музыка Люьви","Жалгызым","ЬМВ","Мерседес бенс","ауди","мазда","хонда"]
# print(name_list[2:7])
#задача 4
# name_jist =["Бишкек", "Ош","Нарын","Заманчивая","Кетким келет","До коонца","ЬМВ","Мерседес бенс","Мазда",'p']
# del name_jist[2]
# del name_jist[8]
# name_jist1=["хонда", "лев","Баткен","ауди","жалал-абат"]
# name_jist.extend(name_jist1)
# print(name_jist) 
#Задача 5
# num = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
# num.pop(2)
# num.pop(15)
# num.insert(0,5)
# num.insert(1,9)
# print(num)
#Задача 6
# numbers =[2,3,1,52,56,8,3,58,0,98,75,3,45,21,44,2,1,4,5,6, 909,4,24,653,12,43,2,5,
# 8,5,3,6,8,0,2,12,4,32,5,7,43,8,0,8,654,235,65,2,3,6,0,9,8,6,43,2,4,56,2,
# 36,7,954,2,34,6,8,45,2,4,5,73,1,32,5,321,452,3]
# numbers.sort()
# numbers.reverse()   #задания 7
# print(numbers)
# print(numbers.count(2))
# print(numbers.count(5))  #задача 8
# print(numbers.count(3))
#задача 9 
# num =[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,7,18,19,20]
# print(sum(num) / len(num))
# Доп 1
# numbers = [1,2,3,4,5,6,7,8,9,10,]
# print(min(numbers))

# # Доп 2
# print(max(numbers))


# # Доп 3
# print(sum(numbers))

# Доп 4
# name =["Бишкек", "Ош","Нарын","Заманчивая","Кетким келет","До коонца","ЬМВ","Мерседес бенс","Мазда",'p']
# name[3], name[7] = name[7] , name[3]
# print(name)
# Доп 5
# number = list(range(1, 21, 2))
# print(number)