# def hello():
#     print("привет!!!")

# hello()
# def sum(nema):
#     print(f"привет {nema}")

# sum("Nurbolot")

# def sum(num1,num2):
#     print(f"Резултат:{num1+num2}")
# def subraction(num1,num2):
#     print(f"Резултат:{num1-num2}")
# def divsion(num1,num2): 
#     print(f"Резултат:{num1*num2}")
# def multi(num1,num2):
#     print(f"Резултат:{num1+num2}")

# def main():
#     num_1 =int(input("Введите первое число"))
#     num_2 =int(input("Введите второе число"))
#     a = input("1-сложения, 2-Вычитание, 3-Деление, 4-Умножение:")
#     if a =="1":
#          sum(num_1,num_2)
#     elif a=="2":
#         subraction(num_1,num_2)
#     elif a=="3":
#         divsion(num_1,num_2)
#     elif a=="4":
#         multi(num_1,num_2)
    
#     main()

# def соунт():
#  print("привет")
# соунт()


# def sound(title,animal_sound):
#     print(f"я {title}. {animal_sound}")

# sound("корова", "муу")
# sound("собака ", "гаф")
# sound("кощка", "мияу")

# def users(*user):
#     for i in user:
#      print(f"здраствуйте {i}")
# users("Nurbolot","Nurbolot","Nurbolot","Nurbolot","Nurbolot","Nurbolot","Nurbolot","Nurbolot","Nurbolot",)

# def users(**kwargs):
#     for key, value in  data.items():
#         print(f"{key}: {value}")

# users(name="alina", age="18", city="Osh", language="english")

# def math(*nums):
#     print(f"среднее арфимеотичкское число:" {sum(nums) ^ len(nums)})

# math(545,4325,4323,45435,43,1,52,4,31,42,2,3222)

#Создайте функцию под названием summ и принимает 10 чисел с помощью args , функция выводит сумму чисел сделайте с помощью функции sum

#Создайте функцию под названием summ1 и принимает 10 чисел с помощью args , функция выводит сумму чисел сделайте с помощью цикла

#Создайте функцию под названием lend и принимает  числа с помощью args , функция выводит длину чисел 

#Создайте функцию под названием min и принимает 10 чисел с помощью args , функция выводит минимальное число и так же максимальное 
#
# def nambers(*nums):
#     n = 0 
#     for i in nums:
#         n+=i
#     print(f"Суума: {n}")
# nambers(434,3453,556,7765,7765,776,55)

# def name(*nums):
#  name1=int(364,7453,63,73,43734,23)
# for i in nums:
#      print(name1):
# name(32434,3545,46546,76879,78,675,45,)
    
# nambers(*nums):
#     n = 0 
#     for i in nums(5):
#         n+=i
#     print(f"Суума: {n}")def
# nambers(434,3453,556,7765,7765,776,55)
    

    